In [1]:
import pandas as pd
import numpy as np

/home/chinmay/anaconda3/lib/python3.6/importlib/_bootstrap.py:219: RuntimeWarning: numpy.dtype size changed, may indicate binary incompatibility. Expected 96, got 88
  return f(*args, **kwds)
/home/chinmay/anaconda3/lib/python3.6/importlib/_bootstrap.py:219: RuntimeWarning: numpy.dtype size changed, may indicate binary incompatibility. Expected 96, got 88
  return f(*args, **kwds)

In [2]:
def into_two(input1):
    return input1*2

In [3]:
def i_want_to_change_2_columns(inputs):
    a,b,c = inputs
    if a == 10 and b == 'foo' and c == 1:
        return 'FOO'
    else:
        return 'ABCD'

In [4]:
df = pd.DataFrame ({'a' : [10,20,30],
             'b' : ['foo', 'bar', 'xyz'],
             'c' : [1,2,3]})

In [32]:
d = {'key1': list(range(10))}

In [34]:
pd.DataFrame(d)

   key1
0     0
1     1
2     2
3     3
4     4
5     5
6     6
7     7
8     8
9     9

In [5]:
df

    a    b  c
0  10  foo  1
1  20  bar  2
2  30  xyz  3

In [8]:
df.loc[:,:].apply(lambda x: x*5)

     a                b   c
0   50  foofoofoofoofoo   5
1  100  barbarbarbarbar  10
2  150  xyzxyzxyzxyzxyz  15

In [15]:
type(df.loc[:,'b'][0])

str

In [17]:
df['a'] = df['a'].astype(str)

In [18]:
type(df.loc[:,'a'][0])

str

In [19]:
df

    a    b  c
0  10  foo  1
1  20  bar  2
2  30  xyz  3

In [20]:
df.loc[:,'a'].apply(lambda x: x*5)

0    1010101010
1    2020202020
2    3030303030
Name: a, dtype: object

In [21]:
df['a'] = df['a'].astype(int)

In [22]:
df.loc[:,'a'].apply(lambda x: x*5)

0     50
1    100
2    150
Name: a, dtype: int64

In [25]:
df.loc[:,'a'] + df.loc[:,'c']

0    11
1    22
2    33
dtype: int64

In [26]:
df

    a    b  c
0  10  foo  1
1  20  bar  2
2  30  xyz  3

In [38]:
df.apply(lambda x: (x['a']* 10) + x['c'], axis = 1)

0    101
1    202
2    303
dtype: int64

In [28]:
df.apply(lambda x: x['a'] + x['c'], axis = 1)

0    11
1    22
2    33
dtype: int64

In [39]:
df.apply(lambda x: x["a"] * x["c"], axis = 1)

0    10
1    40
2    90
dtype: int64

In [40]:
df['a'].apply(lambda x: x ** 2)

0    100
1    400
2    900
Name: a, dtype: int64

In [ ]:
df['b'].apply(into_two)

In [ ]:
df[['a','b','c']].apply(i_want_to_change_2_columns,axis=1)

In [54]:
def i_want_to_change_2_columns(inputs):
    a = inputs
    if a == 10:
        return 'FOO'
    else:
        return 'ABCD'

In [50]:
df

    a    b  c
0  10  foo  1
1  20  bar  2
2  30  xyz  3

In [55]:
df['a'].apply(i_want_to_change_2_columns)

0     FOO
1    ABCD
2    ABCD
Name: a, dtype: object

In [56]:
# Merging on multiple keys
left = pd.DataFrame({
    'key1': ['K0', 'K4', 'K1', 'K2'],
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3']
})
    
right = pd.DataFrame({
    'key1': ['K0', 'K1', 'K2', 'K3'],
    'C': ['C0', 'C1', 'C2', 'C3'],
    'D': ['D0', 'D1', 'D2', 'D3']
})

In [57]:
left

  key1   A   B
0   K0  A0  B0
1   K4  A1  B1
2   K1  A2  B2
3   K2  A3  B3

In [58]:
right

  key1   C   D
0   K0  C0  D0
1   K1  C1  D1
2   K2  C2  D2
3   K3  C3  D3

In [60]:
pd.merge(left, right, how='left', on=['key1'])

  key1   A   B    C    D
0   K0  A0  B0   C0   D0
1   K4  A1  B1  NaN  NaN
2   K1  A2  B2   C1   D1
3   K2  A3  B3   C2   D2

In [61]:
pd.merge(left, right, how='outer', on=['key1'])

  key1    A    B    C    D
0   K0   A0   B0   C0   D0
1   K4   A1   B1  NaN  NaN
2   K1   A2   B2   C1   D1
3   K2   A3   B3   C2   D2
4   K3  NaN  NaN   C3   D3